routes_practice/app/controllers/application_controller.rb

    def find_user_by_id(user_id)
        user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]