routes_practice/app/controllers/artwork_shares_controller.rb

    def create
        artworkshare = ArtworkShare.new(artwork_shares_params)

        if artworkshare.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 6], ["created_at", "2023-03-09 23:21:56.832658"], ["updated_at", "2023-03-09 23:21:56.832658"]]

    def index
        render json: ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def find_as_by_id(as_id)

        artshare = ArtworkShare.find_by(id: as_id)
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]