routes_practice/app/controllers/artworks_controller.rb

UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "thefirstsupper.com"], ["updated_at", "2023-03-09 22:45:21.951824"], ["id", 7]]
---
    def update
        artwork = find_by_artwork_id(params[:id])
        if artwork
            artwork.title = artwork_params[:title] if artwork_params[:title]
            artwork.image_url = artwork_params[:image_url] if artwork_params[:image_url]
            artwork.artist_id = artwork_params[:artist_id] if artwork_params[:artist_id]
            if artwork.save

DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 8]]
---
    def destroy
        artwork = find_by_artwork_id(params[:id])

        if artwork && artwork.destroy

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def find_by_artwork_id(artwork_id)
        artwork = Artwork.find_by(id: artwork_id)