routes_practice/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (3) LIMIT $1  [["LIMIT", 1]]
---
    def show
        user = User.find(params[:id])