routes_practice/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "chris@twitter.com"], ["updated_at", "2023-03-09 17:29:53.546440"], ["id", 4]]
---
    def update
        user = User.find_by(id: params[:id])

        if user
            user.username = user_params[:username] || user.username
            # user.email = user_params[:email] || user.email
            user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
---
    def find_user_by_id(user_id)
        user = User.find_by(id: user_id)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
        user = find_user_by_id(params[:id])

        if user
            user.destroy